# -*- mode: org; mode: flyspell; ispell-local-dictionary: "hu" -*-
#+TITLE: Assembly

18+18 alkalom
* Áttekintés
** Első félév
| Hardver+szoftver        |  2 |
| Linux                   |  2 |
| bash                    |  2 |
| Szám ábrázolás          |  1 |
| CPU regiszterek memória |  3 |
| Paraméterek             |  1 |
| Fájl kezelés            |  2 |
| Összeadás kivonás       |  1 |
| Szorzás Osztás          |  2 |
| Ellenőrzők              |  2 |
|-------------------------+----|
|                         | 18 |
#+TBLFM: @>$2=vsum(@1$2..@-1$2)
** Második félév
| Elágazások és ciklusok    |  4 |
| Függvények                |  3 |
| Makrók                    |  2 |
| Linkelés                  |  1 |
| Beillesztés más nyelvekbe |  2 |
| Párhuzamos programozás    |  2 |
| Ellenőrzők                |  3 |
|---------------------------+----|
|                           | 17 |
#+TBLFM: @>$2=vsum(@1$2..@-1$2)
* TODO Ötletek 
** Endian
** Pipeline
** Vektor regiszterek
** Neumann elvű számítógépek
** FAP
* Hardver és szoftver 1-2
** [[file:3m-1-szgf.org][Számítógépek felépítése]] (telepítés)
** [[file:3m-2-os.org][Operációs rendszerek]] 
* Linux 3-7
** [[file:3m-3-linux-install.org][Linux telepítés]] (firefox, apt-get)
** [[file:3m-4-linux.org][Linux elmélet]] 
** [[file:3m-5-bash.org][BASH]] (fpc, gcc, gedit)
** Bash parancsok 
** Ellenőrző (Bash gyakorlás)
* Assembly intro 8-12
** Assembly 
*** yasm
*** "Hello world"
*** Szintaxis
** GPR, Flag regiszter, MOV (make, watch)
*** Cimkék
*** Direkt és indirekt címzés
*** Visszatérési érték
** Kiírás
** Számábrázolás (makefile)
*** Előjel nélküli egészek
*** Előjeles egészek
*** Lebegő pontos egyszeres pontosságú
*** Lebegő pontos dupla pontosságú 
** Ellenőrző
* Assembly alapok 13-18
** ADD és SUB (char2int)
** MUL és DIV 
** CMP és Jxx (gcd)
** Elágazások és ciklusok 
** Gyakorlás (ex-gcd)
** Ellenőrző 
* Függvények és makrók 19-24
** Függvények és függvény hívások (szita)
** Paraméterek és visszatérési érték
** Gyakorlás (MMIX primek)
** Makrók
** Makró paraméterek
** Ellenőrző
* Assembly és más nyelvek 25-27
** Assembly és C
** Assembly és pascal
** Ellenőrző
* Optimalizáció 28-36
** SSE regiszterek + műveletek
** SSE műveletek 
** OpenMP
** MPI 
** Kétszavas összeadás és szorzás
** Kétszavas osztás
** Ellenőrző
** Javítások
** Jegyek




